[
    {
        "title": "TBAC-UniImage: Unified Understanding and Generation by Ladder-Side Diffusion Tuning",
        "summary": "This paper introduces TBAC-UniImage, a novel unified model for multimodal\nunderstanding and generation. We achieve this by deeply integrating a\npre-trained Diffusion Model, acting as a generative ladder, with a Multimodal\nLarge Language Model (MLLM). Previous diffusion-based unified models face two\nprimary limitations. One approach uses only the MLLM's final hidden state as\nthe generative condition. This creates a shallow connection, as the generator\nis isolated from the rich, hierarchical representations within the MLLM's\nintermediate layers. The other approach, pretraining a unified generative\narchitecture from scratch, is computationally expensive and prohibitive for\nmany researchers. To overcome these issues, our work explores a new paradigm.\nInstead of relying on a single output, we use representations from multiple,\ndiverse layers of the MLLM as generative conditions for the diffusion model.\nThis method treats the pre-trained generator as a ladder, receiving guidance\nfrom various depths of the MLLM's understanding process. Consequently,\nTBAC-UniImage achieves a much deeper and more fine-grained unification of\nunderstanding and generation.",
        "url": "http://arxiv.org/abs/2508.08098v1",
        "published_date": "2025-08-11T15:37:22+00:00",
        "updated_date": "2025-08-11T15:37:22+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Junzhe Xu",
            "Yuyang Yin",
            "Xi Chen"
        ],
        "tldr": "TBAC-UniImage presents a novel unified multimodal understanding and generation model that deeply integrates a pre-trained Diffusion Model with an MLLM by conditioning the diffusion model on multiple layers of the MLLM, leading to a more fine-grained unification.",
        "tldr_zh": "TBAC-UniImage 提出了一种新的统一多模态理解和生成模型，通过将预训练的扩散模型与 MLLM 深度集成，并以 MLLM 的多个层作为扩散模型的条件，从而实现更精细的统一。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]