[
    {
        "title": "TaleForge: Interactive Multimodal System for Personalized Story Creation",
        "summary": "Storytelling is a deeply personal and creative process, yet existing methods\noften treat users as passive consumers, offering generic plots with limited\npersonalization. This undermines engagement and immersion, especially where\nindividual style or appearance is crucial. We introduce TaleForge, a\npersonalized story-generation system that integrates large language models\n(LLMs) and text-to-image diffusion to embed users' facial images within both\nnarratives and illustrations. TaleForge features three interconnected modules:\nStory Generation, where LLMs create narratives and character descriptions from\nuser prompts; Personalized Image Generation, merging users' faces and outfit\nchoices into character illustrations; and Background Generation, creating scene\nbackdrops that incorporate personalized characters. A user study demonstrated\nheightened engagement and ownership when individuals appeared as protagonists.\nParticipants praised the system's real-time previews and intuitive controls,\nthough they requested finer narrative editing tools. TaleForge advances\nmultimodal storytelling by aligning personalized text and imagery to create\nimmersive, user-centric experiences.",
        "url": "http://arxiv.org/abs/2506.21832v1",
        "published_date": "2025-06-27T00:45:38+00:00",
        "updated_date": "2025-06-27T00:45:38+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Minh-Loi Nguyen",
            "Quang-Khai Le",
            "Tam V. Nguyen",
            "Minh-Triet Tran",
            "Trung-Nghia Le"
        ],
        "tldr": "TaleForge is a personalized story generation system using LLMs and text-to-image diffusion, embedding user faces into narratives and illustrations, reportedly increasing engagement.",
        "tldr_zh": "TaleForge是一个个性化的故事生成系统，它使用大型语言模型和文本到图像扩散技术，将用户面部嵌入到叙事和插图中，据称可以提高用户参与度。",
        "relevance_score": 9,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "Exploring Image Generation via Mutually Exclusive Probability Spaces and Local Correlation Hypothesis",
        "summary": "We propose two theoretical frameworks, the Mutually Exclusive Probability\nSpace (MESP) and the Local Correlation Hypothesis (LCH), to explore a potential\nlimitation in probabilistic generative models; namely that learning global\ndistributions leads to memorization rather than generative behavior. MESP\nemerges from our rethinking of the Variational Autoencoder (VAE). We observe\nthat latent variable distributions in VAE exhibit overlap, which leads to an\noptimization conflict between the reconstruction loss and KL-divergence loss. A\nlower bound based on the overlap coefficient is proposed. We refer to this\nphenomenon as Mutually Exclusive Probability Spaces. Based on MESP, a Binary\nLatent Autoencoder (BL-AE) is proposed to encode images into binary latent\nrepresentations. These binary latents are used as the input to our\nAutoregressive Random Variable Model (ARVM), a modified autoregressive model\noutputting histograms. Our ARVM achieves competitive FID scores, outperforming\nstate-of-the-art methods on standard datasets. However, such scores reflect\nmemorization rather than generation. To address this issue, we propose the\nLocal Correlation Hypothesis (LCH), which posits that generative capability\narising from local correlations among latent variables. Comprehensive\nexperiments and discussions are conducted to validate our frameworks.",
        "url": "http://arxiv.org/abs/2506.21731v1",
        "published_date": "2025-06-26T19:32:29+00:00",
        "updated_date": "2025-06-26T19:32:29+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Chenqiu Zhao",
            "Anup Basu"
        ],
        "tldr": "This paper introduces two frameworks, MESP and LCH, to address memorization issues in probabilistic generative models, proposing a Binary Latent Autoencoder and Autoregressive Random Variable Model. It emphasizes the importance of local correlations for genuine generative behavior, even if global metrics like FID are good.",
        "tldr_zh": "本文提出了两个框架，MESP和LCH，旨在解决概率生成模型中的记忆化问题，并提出了二元潜在自编码器和自回归随机变量模型。它强调了局部相关性对于真正的生成行为的重要性，即使全局指标如FID表现良好。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 8,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]