[
    {
        "title": "EditThinker: Unlocking Iterative Reasoning for Any Image Editor",
        "summary": "Instruction-based image editing has emerged as a prominent research area, which, benefiting from image generation foundation models, have achieved high aesthetic quality, making instruction-following capability the primary challenge. Existing approaches improve instruction adherence via supervised or reinforcement learning, yet single-turn success rates remain limited due to inherent stochasticity and a lack of deliberation. In this work, we propose a deliberative editing framework to 'think' while they edit, which simulates the human cognitive loop by iteratively executing a Think-while-Edit cycle: Critiquing results and Refining instructions , followed by Repeating the generation until satisfactory. Specifically, we train a single MLLM, EditThinker, to act as the reasoning engine of this framework, which jointly produce the critique score, reasoning process, and refined instructions. We employ reinforcement learning to align the EditThinker's thinking with its editing, thereby generating more targeted instruction improvements. Extensive experiments on four benchmarks demonstrate that our approach significantly improves the instruction-following capability of any image editing model by a large margin. We will release our data construction framework, datasets, and models to benefit the community.",
        "url": "http://arxiv.org/abs/2512.05965v1",
        "published_date": "2025-12-05T18:58:09+00:00",
        "updated_date": "2025-12-05T18:58:09+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Hongyu Li",
            "Manyuan Zhang",
            "Dian Zheng",
            "Ziyu Guo",
            "Yimeng Jia",
            "Kaituo Feng",
            "Hao Yu",
            "Yexin Liu",
            "Yan Feng",
            "Peng Pei",
            "Xunliang Cai",
            "Linjiang Huang",
            "Hongsheng Li",
            "Si Liu"
        ],
        "tldr": "The paper introduces EditThinker, a framework that iteratively refines image editing instructions through critique and refinement, improving instruction-following for image editing models via reinforcement learning.",
        "tldr_zh": "该论文介绍了EditThinker，一个通过迭代地批判和改进图像编辑指令的框架，通过强化学习提升图像编辑模型对指令的遵循能力。",
        "relevance_score": 8,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    }
]