[
    {
        "title": "Ovis-U1 Technical Report",
        "summary": "In this report, we introduce Ovis-U1, a 3-billion-parameter unified model\nthat integrates multimodal understanding, text-to-image generation, and image\nediting capabilities. Building on the foundation of the Ovis series, Ovis-U1\nincorporates a diffusion-based visual decoder paired with a bidirectional token\nrefiner, enabling image generation tasks comparable to leading models like\nGPT-4o. Unlike some previous models that use a frozen MLLM for generation\ntasks, Ovis-U1 utilizes a new unified training approach starting from a\nlanguage model. Compared to training solely on understanding or generation\ntasks, unified training yields better performance, demonstrating the\nenhancement achieved by integrating these two tasks. Ovis-U1 achieves a score\nof 69.6 on the OpenCompass Multi-modal Academic Benchmark, surpassing recent\nstate-of-the-art models such as Ristretto-3B and SAIL-VL-1.5-2B. In\ntext-to-image generation, it excels with scores of 83.72 and 0.89 on the\nDPG-Bench and GenEval benchmarks, respectively. For image editing, it achieves\n4.00 and 6.42 on the ImgEdit-Bench and GEdit-Bench-EN, respectively. As the\ninitial version of the Ovis unified model series, Ovis-U1 pushes the boundaries\nof multimodal understanding, generation, and editing.",
        "url": "http://arxiv.org/abs/2506.23044v1",
        "published_date": "2025-06-29T00:40:17+00:00",
        "updated_date": "2025-06-29T00:40:17+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Guo-Hua Wang",
            "Shanshan Zhao",
            "Xinjie Zhang",
            "Liangfu Cao",
            "Pengxin Zhan",
            "Lunhao Duan",
            "Shiyin Lu",
            "Minghao Fu",
            "Xiaohao Chen",
            "Jianshan Zhao",
            "Yang Li",
            "Qing-Guo Chen"
        ],
        "tldr": "Ovis-U1 is a new 3B parameter unified multimodal model that integrates multimodal understanding, text-to-image generation, and image editing, achieving state-of-the-art performance on several benchmarks through unified training.",
        "tldr_zh": "Ovis-U1是一个新的30亿参数的统一多模态模型，集成了多模态理解、文本到图像生成和图像编辑功能，通过统一训练在多个基准测试中实现了最先进的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]