[
    {
        "title": "Align Your Flow: Scaling Continuous-Time Flow Map Distillation",
        "summary": "Diffusion- and flow-based models have emerged as state-of-the-art generative\nmodeling approaches, but they require many sampling steps. Consistency models\ncan distill these models into efficient one-step generators; however, unlike\nflow- and diffusion-based methods, their performance inevitably degrades when\nincreasing the number of steps, which we show both analytically and\nempirically. Flow maps generalize these approaches by connecting any two noise\nlevels in a single step and remain effective across all step counts. In this\npaper, we introduce two new continuous-time objectives for training flow maps,\nalong with additional novel training techniques, generalizing existing\nconsistency and flow matching objectives. We further demonstrate that\nautoguidance can improve performance, using a low-quality model for guidance\nduring distillation, and an additional boost can be achieved by adversarial\nfinetuning, with minimal loss in sample diversity. We extensively validate our\nflow map models, called Align Your Flow, on challenging image generation\nbenchmarks and achieve state-of-the-art few-step generation performance on both\nImageNet 64x64 and 512x512, using small and efficient neural networks. Finally,\nwe show text-to-image flow map models that outperform all existing\nnon-adversarially trained few-step samplers in text-conditioned synthesis.",
        "url": "http://arxiv.org/abs/2506.14603v1",
        "published_date": "2025-06-17T15:06:07+00:00",
        "updated_date": "2025-06-17T15:06:07+00:00",
        "categories": [
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Amirmojtaba Sabour",
            "Sanja Fidler",
            "Karsten Kreis"
        ],
        "tldr": "The paper introduces \"Align Your Flow,\" a new approach to training continuous-time flow maps for few-step image generation, achieving state-of-the-art results on ImageNet and text-to-image synthesis.",
        "tldr_zh": "本文介绍了一种名为“Align Your Flow”的新方法，用于训练连续时间流图，以进行少步图像生成，并在 ImageNet 和文本到图像合成方面取得了最先进的成果。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]