[
    {
        "title": "DeepVerse: 4D Autoregressive Video Generation as a World Model",
        "summary": "World models serve as essential building blocks toward Artificial General\nIntelligence (AGI), enabling intelligent agents to predict future states and\nplan actions by simulating complex physical interactions. However, existing\ninteractive models primarily predict visual observations, thereby neglecting\ncrucial hidden states like geometric structures and spatial coherence. This\nleads to rapid error accumulation and temporal inconsistency. To address these\nlimitations, we introduce DeepVerse, a novel 4D interactive world model\nexplicitly incorporating geometric predictions from previous timesteps into\ncurrent predictions conditioned on actions. Experiments demonstrate that by\nincorporating explicit geometric constraints, DeepVerse captures richer\nspatio-temporal relationships and underlying physical dynamics. This capability\nsignificantly reduces drift and enhances temporal consistency, enabling the\nmodel to reliably generate extended future sequences and achieve substantial\nimprovements in prediction accuracy, visual realism, and scene rationality.\nFurthermore, our method provides an effective solution for geometry-aware\nmemory retrieval, effectively preserving long-term spatial consistency. We\nvalidate the effectiveness of DeepVerse across diverse scenarios, establishing\nits capacity for high-fidelity, long-horizon predictions grounded in\ngeometry-aware dynamics.",
        "url": "http://arxiv.org/abs/2506.01103v1",
        "published_date": "2025-06-01T17:58:36+00:00",
        "updated_date": "2025-06-01T17:58:36+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Junyi Chen",
            "Haoyi Zhu",
            "Xianglong He",
            "Yifan Wang",
            "Jianjun Zhou",
            "Wenzheng Chang",
            "Yang Zhou",
            "Zizun Li",
            "Zhoujie Fu",
            "Jiangmiao Pang",
            "Tong He"
        ],
        "tldr": "DeepVerse is a new 4D world model for video generation that explicitly incorporates geometric predictions to improve spatio-temporal consistency and long-horizon prediction accuracy.",
        "tldr_zh": "DeepVerse 是一种新的 4D 世界模型，用于视频生成，它明确地结合了几何预测，以提高时空一致性和长时程预测准确性。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]