[
    {
        "title": "InfinityStar: Unified Spacetime AutoRegressive Modeling for Visual Generation",
        "summary": "We introduce InfinityStar, a unified spacetime autoregressive framework for\nhigh-resolution image and dynamic video synthesis. Building on the recent\nsuccess of autoregressive modeling in both vision and language, our purely\ndiscrete approach jointly captures spatial and temporal dependencies within a\nsingle architecture. This unified design naturally supports a variety of\ngeneration tasks such as text-to-image, text-to-video, image-to-video, and long\ninteractive video synthesis via straightforward temporal autoregression.\nExtensive experiments demonstrate that InfinityStar scores 83.74 on VBench,\noutperforming all autoregressive models by large margins, even surpassing some\ndiffusion competitors like HunyuanVideo. Without extra optimizations, our model\ngenerates a 5s, 720p video approximately 10x faster than leading\ndiffusion-based methods. To our knowledge, InfinityStar is the first discrete\nautoregressive video generator capable of producing industrial level 720p\nvideos. We release all code and models to foster further research in efficient,\nhigh-quality video generation.",
        "url": "http://arxiv.org/abs/2511.04675v1",
        "published_date": "2025-11-06T18:58:03+00:00",
        "updated_date": "2025-11-06T18:58:03+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Jinlai Liu",
            "Jian Han",
            "Bin Yan",
            "Hui Wu",
            "Fengda Zhu",
            "Xing Wang",
            "Yi Jiang",
            "Bingyue Peng",
            "Zehuan Yuan"
        ],
        "tldr": "InfinityStar is a unified autoregressive model for high-resolution image and video synthesis, achieving state-of-the-art performance and efficiency compared to existing autoregressive and diffusion models, particularly in generating 720p videos.",
        "tldr_zh": "InfinityStar是一个统一的自回归模型，用于高分辨率图像和视频合成，与现有的自回归和扩散模型相比，实现了最先进的性能和效率，尤其是在生成720p视频方面。",
        "relevance_score": 10,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    }
]