[
    {
        "title": "MAViS: A Multi-Agent Framework for Long-Sequence Video Storytelling",
        "summary": "Despite recent advances, long-sequence video generation frameworks still\nsuffer from significant limitations: poor assistive capability, suboptimal\nvisual quality, and limited expressiveness. To mitigate these limitations, we\npropose MAViS, an end-to-end multi-agent collaborative framework for\nlong-sequence video storytelling. MAViS orchestrates specialized agents across\nmultiple stages, including script writing, shot designing, character modeling,\nkeyframe generation, video animation, and audio generation. In each stage,\nagents operate under the 3E Principle -- Explore, Examine, and Enhance -- to\nensure the completeness of intermediate outputs. Considering the capability\nlimitations of current generative models, we propose the Script Writing\nGuidelines to optimize compatibility between scripts and generative tools.\nExperimental results demonstrate that MAViS achieves state-of-the-art\nperformance in assistive capability, visual quality, and video expressiveness.\nIts modular framework further enables scalability with diverse generative\nmodels and tools. With just a brief user prompt, MAViS is capable of producing\nhigh-quality, expressive long-sequence video storytelling, enriching\ninspirations and creativity for users. To the best of our knowledge, MAViS is\nthe only framework that provides multimodal design output -- videos with\nnarratives and background music.",
        "url": "http://arxiv.org/abs/2508.08487v1",
        "published_date": "2025-08-11T21:42:41+00:00",
        "updated_date": "2025-08-11T21:42:41+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.MA"
        ],
        "authors": [
            "Qian Wang",
            "Ziqi Huang",
            "Ruoxi Jia",
            "Paul Debevec",
            "Ning Yu"
        ],
        "tldr": "The paper introduces MAViS, a multi-agent framework for generating long-sequence videos with script writing, shot design, and audio generation capabilities, claiming state-of-the-art performance in assistive capability, visual quality, and video expressiveness.",
        "tldr_zh": "该论文介绍了MAViS，一个用于生成长序列视频的多智能体框架，具备剧本编写、镜头设计和音频生成能力，并声称在辅助能力、视觉质量和视频表现力方面达到了最先进的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]