[
    {
        "title": "SwiftVideo: A Unified Framework for Few-Step Video Generation through Trajectory-Distribution Alignment",
        "summary": "Diffusion-based or flow-based models have achieved significant progress in\nvideo synthesis but require multiple iterative sampling steps, which incurs\nsubstantial computational overhead. While many distillation methods that are\nsolely based on trajectory-preserving or distribution-matching have been\ndeveloped to accelerate video generation models, these approaches often suffer\nfrom performance breakdown or increased artifacts under few-step settings. To\naddress these limitations, we propose \\textbf{\\emph{SwiftVideo}}, a unified and\nstable distillation framework that combines the advantages of\ntrajectory-preserving and distribution-matching strategies. Our approach\nintroduces continuous-time consistency distillation to ensure precise\npreservation of ODE trajectories. Subsequently, we propose a dual-perspective\nalignment that includes distribution alignment between synthetic and real data\nalong with trajectory alignment across different inference steps. Our method\nmaintains high-quality video generation while substantially reducing the number\nof inference steps. Quantitative evaluations on the OpenVid-1M benchmark\ndemonstrate that our method significantly outperforms existing approaches in\nfew-step video generation.",
        "url": "http://arxiv.org/abs/2508.06082v1",
        "published_date": "2025-08-08T07:26:34+00:00",
        "updated_date": "2025-08-08T07:26:34+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yanxiao Sun",
            "Jiafu Wu",
            "Yun Cao",
            "Chengming Xu",
            "Yabiao Wang",
            "Weijian Cao",
            "Donghao Luo",
            "Chengjie Wang",
            "Yanwei Fu"
        ],
        "tldr": "SwiftVideo is a new distillation framework for accelerating video generation that combines trajectory-preserving and distribution-matching strategies, outperforming existing methods in few-step generation on OpenVid-1M.",
        "tldr_zh": "SwiftVideo是一个新的视频生成加速框架，结合了轨迹保持和分布匹配策略，在OpenVid-1M上优于现有的 few-step 生成方法。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]