[
    {
        "title": "Straighten Viscous Rectified Flow via Noise Optimization",
        "summary": "The Reflow operation aims to straighten the inference trajectories of the\nrectified flow during training by constructing deterministic couplings between\nnoises and images, thereby improving the quality of generated images in\nsingle-step or few-step generation. However, we identify critical limitations\nin Reflow, particularly its inability to rapidly generate high-quality images\ndue to a distribution gap between images in its constructed deterministic\ncouplings and real images. To address these shortcomings, we propose a novel\nalternative called Straighten Viscous Rectified Flow via Noise Optimization\n(VRFNO), which is a joint training framework integrating an encoder and a\nneural velocity field. VRFNO introduces two key innovations: (1) a historical\nvelocity term that enhances trajectory distinction, enabling the model to more\naccurately predict the velocity of the current trajectory, and (2) the noise\noptimization through reparameterization to form optimized couplings with real\nimages which are then utilized for training, effectively mitigating errors\ncaused by Reflow's limitations. Comprehensive experiments on synthetic data and\nreal datasets with varying resolutions show that VRFNO significantly mitigates\nthe limitations of Reflow, achieving state-of-the-art performance in both\none-step and few-step generation tasks.",
        "url": "http://arxiv.org/abs/2507.10218v1",
        "published_date": "2025-07-14T12:35:17+00:00",
        "updated_date": "2025-07-14T12:35:17+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Jimin Dai",
            "Jiexi Yan",
            "Jian Yang",
            "Lei Luo"
        ],
        "tldr": "The paper introduces VRFNO, a novel method to improve rectified flow models for image generation by addressing limitations in Reflow via noise optimization and a historical velocity term, achieving state-of-the-art performance in single/few-step generation.",
        "tldr_zh": "该论文介绍了VRFNO，一种通过噪声优化和历史速度项来改进校正流模型的创新方法，旨在解决Reflow的局限性，并在单步/少步生成任务中实现了最先进的性能。",
        "relevance_score": 8,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "Latent Diffusion Models with Masked AutoEncoders",
        "summary": "In spite of remarkable potential of the Latent Diffusion Models (LDMs) in\nimage generation, the desired properties and optimal design of the autoencoders\nhave been underexplored. In this work, we analyze the role of autoencoders in\nLDMs and identify three key properties: latent smoothness, perceptual\ncompression quality, and reconstruction quality. We demonstrate that existing\nautoencoders fail to simultaneously satisfy all three properties, and propose\nVariational Masked AutoEncoders (VMAEs), taking advantage of the hierarchical\nfeatures maintained by Masked AutoEncoder. We integrate VMAEs into the LDM\nframework, introducing Latent Diffusion Models with Masked AutoEncoders\n(LDMAEs). Through comprehensive experiments, we demonstrate significantly\nenhanced image generation quality and computational efficiency.",
        "url": "http://arxiv.org/abs/2507.09984v1",
        "published_date": "2025-07-14T07:00:43+00:00",
        "updated_date": "2025-07-14T07:00:43+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Junho Lee",
            "Jeongwoo Shin",
            "Hyungwook Choi",
            "Joonseok Lee"
        ],
        "tldr": "This paper proposes Variational Masked AutoEncoders (VMAEs) to improve Latent Diffusion Models (LDMs) by addressing limitations in existing autoencoders, which leads to enhanced image generation quality and efficiency.",
        "tldr_zh": "本文提出了变分掩码自编码器（VMAEs）以改进潜在扩散模型（LDMs），通过解决现有自编码器的局限性，从而提高图像生成质量和效率。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]