[
    {
        "title": "Echo-4o: Harnessing the Power of GPT-4o Synthetic Images for Improved Image Generation",
        "summary": "Recently, GPT-4o has garnered significant attention for its strong\nperformance in image generation, yet open-source models still lag behind.\nSeveral studies have explored distilling image data from GPT-4o to enhance\nopen-source models, achieving notable progress. However, a key question\nremains: given that real-world image datasets already constitute a natural\nsource of high-quality data, why should we use GPT-4o-generated synthetic data?\nIn this work, we identify two key advantages of synthetic images. First, they\ncan complement rare scenarios in real-world datasets, such as surreal fantasy\nor multi-reference image generation, which frequently occur in user queries.\nSecond, they provide clean and controllable supervision. Real-world data often\ncontains complex background noise and inherent misalignment between text\ndescriptions and image content, whereas synthetic images offer pure backgrounds\nand long-tailed supervision signals, facilitating more accurate text-to-image\nalignment. Building on these insights, we introduce Echo-4o-Image, a 180K-scale\nsynthetic dataset generated by GPT-4o, harnessing the power of synthetic image\ndata to address blind spots in real-world coverage. Using this dataset, we\nfine-tune the unified multimodal generation baseline Bagel to obtain Echo-4o.\nIn addition, we propose two new evaluation benchmarks for a more accurate and\nchallenging assessment of image generation capabilities: GenEval++, which\nincreases instruction complexity to mitigate score saturation, and\nImagine-Bench, which focuses on evaluating both the understanding and\ngeneration of imaginative content. Echo-4o demonstrates strong performance\nacross standard benchmarks. Moreover, applying Echo-4o-Image to other\nfoundation models (e.g., OmniGen2, BLIP3-o) yields consistent performance gains\nacross multiple metrics, highlighting the datasets strong transferability.",
        "url": "http://arxiv.org/abs/2508.09987v1",
        "published_date": "2025-08-13T17:59:28+00:00",
        "updated_date": "2025-08-13T17:59:28+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.CL"
        ],
        "authors": [
            "Junyan Ye",
            "Dongzhi Jiang",
            "Zihao Wang",
            "Leqi Zhu",
            "Zhenghao Hu",
            "Zilong Huang",
            "Jun He",
            "Zhiyuan Yan",
            "Jinghua Yu",
            "Hongsheng Li",
            "Conghui He",
            "Weijia Li"
        ],
        "tldr": "The paper introduces Echo-4o, a GPT-4o-generated synthetic dataset used to fine-tune image generation models, demonstrating performance gains and improved handling of rare and imaginative scenarios, along with two new evaluation benchmarks.",
        "tldr_zh": "本文介绍Echo-4o，一个由GPT-4o生成的合成数据集，用于微调图像生成模型，展示了性能提升和对罕见及富有想象力的场景的更好处理能力，同时提出了两个新的评估基准。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]