[
    {
        "title": "LSSGen: Leveraging Latent Space Scaling in Flow and Diffusion for Efficient Text to Image Generation",
        "summary": "Flow matching and diffusion models have shown impressive results in\ntext-to-image generation, producing photorealistic images through an iterative\ndenoising process. A common strategy to speed up synthesis is to perform early\ndenoising at lower resolutions. However, traditional methods that downscale and\nupscale in pixel space often introduce artifacts and distortions. These issues\narise when the upscaled images are re-encoded into the latent space, leading to\ndegraded final image quality. To address this, we propose {\\bf Latent Space\nScaling Generation (LSSGen)}, a framework that performs resolution scaling\ndirectly in the latent space using a lightweight latent upsampler. Without\naltering the Transformer or U-Net architecture, LSSGen improves both efficiency\nand visual quality while supporting flexible multi-resolution generation. Our\ncomprehensive evaluation covering text-image alignment and perceptual quality\nshows that LSSGen significantly outperforms conventional scaling approaches.\nWhen generating $1024^2$ images at similar speeds, it achieves up to 246\\%\nTOPIQ score improvement.",
        "url": "http://arxiv.org/abs/2507.16154v1",
        "published_date": "2025-07-22T02:05:21+00:00",
        "updated_date": "2025-07-22T02:05:21+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Jyun-Ze Tang",
            "Chih-Fan Hsu",
            "Jeng-Lin Li",
            "Ming-Ching Chang",
            "Wei-Chao Chen"
        ],
        "tldr": "The paper introduces LSSGen, a novel framework for text-to-image generation that performs resolution scaling in latent space, improving efficiency and visual quality compared to pixel-space scaling methods, especially at high resolutions.",
        "tldr_zh": "本文介绍了一种新的文本到图像生成框架LSSGen，该框架在潜在空间中执行分辨率缩放，与像素空间缩放方法相比，提高了效率和视觉质量，尤其是在高分辨率下。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]