[
    {
        "title": "MENTOR: Efficient Multimodal-Conditioned Tuning for Autoregressive Vision Generation Models",
        "summary": "Recent text-to-image models produce high-quality results but still struggle\nwith precise visual control, balancing multimodal inputs, and requiring\nextensive training for complex multimodal image generation. To address these\nlimitations, we propose MENTOR, a novel autoregressive (AR) framework for\nefficient Multimodal-conditioned Tuning for Autoregressive multimodal image\ngeneration. MENTOR combines an AR image generator with a two-stage training\nparadigm, enabling fine-grained, token-level alignment between multimodal\ninputs and image outputs without relying on auxiliary adapters or\ncross-attention modules. The two-stage training consists of: (1) a multimodal\nalignment stage that establishes robust pixel- and semantic-level alignment,\nfollowed by (2) a multimodal instruction tuning stage that balances the\nintegration of multimodal inputs and enhances generation controllability.\nDespite modest model size, suboptimal base components, and limited training\nresources, MENTOR achieves strong performance on the DreamBench++ benchmark,\noutperforming competitive baselines in concept preservation and prompt\nfollowing. Additionally, our method delivers superior image reconstruction\nfidelity, broad task adaptability, and improved training efficiency compared to\ndiffusion-based methods. Dataset, code, and models are available at:\nhttps://github.com/HaozheZhao/MENTOR",
        "url": "http://arxiv.org/abs/2507.09574v1",
        "published_date": "2025-07-13T10:52:59+00:00",
        "updated_date": "2025-07-13T10:52:59+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.CL"
        ],
        "authors": [
            "Haozhe Zhao",
            "Zefan Cai",
            "Shuzheng Si",
            "Liang Chen",
            "Jiuxiang Gu",
            "Wen Xiao",
            "Junjie Hu"
        ],
        "tldr": "The paper introduces MENTOR, an autoregressive framework for efficient multimodal-conditioned image generation, achieving strong performance by token-level alignment via a two-stage training process without complex modules.",
        "tldr_zh": "本文介绍MENTOR，一种用于高效多模态条件图像生成的自回归框架，通过两阶段训练过程实现令牌级对齐，无需复杂模块，并取得了良好的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "RectifiedHR: High-Resolution Diffusion via Energy Profiling and Adaptive Guidance Scheduling",
        "summary": "High-resolution image synthesis with diffusion models often suffers from\nenergy instabilities and guidance artifacts that degrade visual quality. We\nanalyze the latent energy landscape during sampling and propose adaptive\nclassifier-free guidance (CFG) schedules that maintain stable energy\ntrajectories. Our approach introduces energy-aware scheduling strategies that\nmodulate guidance strength over time, achieving superior stability scores\n(0.9998) and consistency metrics (0.9873) compared to fixed-guidance\napproaches. We demonstrate that DPM++ 2M with linear-decreasing CFG scheduling\nyields optimal performance, providing sharper, more faithful images while\nreducing artifacts. Our energy profiling framework serves as a powerful\ndiagnostic tool for understanding and improving diffusion model behavior.",
        "url": "http://arxiv.org/abs/2507.09441v1",
        "published_date": "2025-07-13T01:21:10+00:00",
        "updated_date": "2025-07-13T01:21:10+00:00",
        "categories": [
            "cs.GR",
            "cs.CV"
        ],
        "authors": [
            "Ankit Sanjyal"
        ],
        "tldr": "This paper presents an energy-aware adaptive classifier-free guidance (CFG) scheduling method named RectifiedHR, designed to improve the stability and visual quality of high-resolution image synthesis with diffusion models by addressing energy instabilities and guidance artifacts.",
        "tldr_zh": "该论文提出了一种名为RectifiedHR的能量感知自适应无分类器引导（CFG）调度方法，旨在通过解决能量不稳定性和引导伪影来提高使用扩散模型合成高分辨率图像的稳定性和视觉质量。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]