[
    {
        "title": "ShareGPT-4o-Image: Aligning Multimodal Models with GPT-4o-Level Image Generation",
        "summary": "Recent advances in multimodal generative models have unlocked photorealistic,\ninstruction-aligned image generation, yet leading systems like GPT-4o-Image\nremain proprietary and inaccessible. To democratize these capabilities, we\npresent ShareGPT-4o-Image, the first dataset comprising 45K text-to-image and\n46K text-and-image-to-image data, all synthesized using GPT-4o's image\ngeneration capabilities for distilling its advanced image generation abilities.\nLeveraging this dataset, we develop Janus-4o, a multimodal large language model\ncapable of both text-to-image and text-and-image-to-image generation. Janus-4o\nnot only significantly improves text-to-image generation over its predecessor,\nJanus-Pro, but also newly supports text-and-image-to-image generation. Notably,\nit achieves impressive performance in text-and-image-to-image generation from\nscratch, using only 91K synthetic samples and 6 hours of training on an 8\nA800-GPU machine. We hope the release of ShareGPT-4o-Image and Janus-4o will\nfoster open research in photorealistic, instruction-aligned image generation.",
        "url": "http://arxiv.org/abs/2506.18095v1",
        "published_date": "2025-06-22T16:51:09+00:00",
        "updated_date": "2025-06-22T16:51:09+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.LG"
        ],
        "authors": [
            "Junying Chen",
            "Zhenyang Cai",
            "Pengcheng Chen",
            "Shunian Chen",
            "Ke Ji",
            "Xidong Wang",
            "Yunjin Yang",
            "Benyou Wang"
        ],
        "tldr": "The paper introduces ShareGPT-4o-Image, a dataset distilled from GPT-4o's image generation capabilities, and Janus-4o, a multimodal LLM trained on this dataset, showcasing improved text-to-image and new text-and-image-to-image generation abilities.",
        "tldr_zh": "该论文介绍了ShareGPT-4o-Image数据集，该数据集从GPT-4o的图像生成能力中提取，并介绍了Janus-4o，一个基于该数据集训练的多模态LLM，展示了改进的文本到图像和新的文本及图像到图像的生成能力。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]