[
    {
        "title": "CineScene: Implicit 3D as Effective Scene Representation for Cinematic Video Generation",
        "summary": "Cinematic video production requires control over scene-subject composition and camera movement, but live-action shooting remains costly due to the need for constructing physical sets. To address this, we introduce the task of cinematic video generation with decoupled scene context: given multiple images of a static environment, the goal is to synthesize high-quality videos featuring dynamic subject while preserving the underlying scene consistency and following a user-specified camera trajectory. We present CineScene, a framework that leverages implicit 3D-aware scene representation for cinematic video generation. Our key innovation is a novel context conditioning mechanism that injects 3D-aware features in an implicit way: By encoding scene images into visual representations through VGGT, CineScene injects spatial priors into a pretrained text-to-video generation model by additional context concatenation, enabling camera-controlled video synthesis with consistent scenes and dynamic subjects. To further enhance the model's robustness, we introduce a simple yet effective random-shuffling strategy for the input scene images during training. To address the lack of training data, we construct a scene-decoupled dataset with Unreal Engine 5, containing paired videos of scenes with and without dynamic subjects, panoramic images representing the underlying static scene, along with their camera trajectories. Experiments show that CineScene achieves state-of-the-art performance in scene-consistent cinematic video generation, handling large camera movements and demonstrating generalization across diverse environments.",
        "url": "http://arxiv.org/abs/2602.06959v1",
        "published_date": "2026-02-06T18:59:24+00:00",
        "updated_date": "2026-02-06T18:59:24+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Kaiyi Huang",
            "Yukun Huang",
            "Yu Li",
            "Jianhong Bai",
            "Xintao Wang",
            "Zinan Lin",
            "Xuefei Ning",
            "Jiwen Yu",
            "Pengfei Wan",
            "Yu Wang",
            "Xihui Liu"
        ],
        "tldr": "CineScene generates cinematic videos with user-specified camera trajectories and dynamic subjects by leveraging implicit 3D-aware scene representation, achieving state-of-the-art performance in scene consistency and generalization, even with large camera movements.",
        "tldr_zh": "CineScene利用隐式3D感知场景表示生成电影级视频，该视频具有用户指定的相机轨迹和动态主体，在场景一致性和泛化方面实现了最先进的性能，即使在大型相机运动的情况下也是如此。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]