[
    {
        "title": "FlexAM: Flexible Appearance-Motion Decomposition for Versatile Video Generation Control",
        "summary": "Effective and generalizable control in video generation remains a significant challenge. While many methods rely on ambiguous or task-specific signals, we argue that a fundamental disentanglement of \"appearance\" and \"motion\" provides a more robust and scalable pathway. We propose FlexAM, a unified framework built upon a novel 3D control signal. This signal represents video dynamics as a point cloud, introducing three key enhancements: multi-frequency positional encoding to distinguish fine-grained motion, depth-aware positional encoding, and a flexible control signal for balancing precision and generative quality. This representation allows FlexAM to effectively disentangle appearance and motion, enabling a wide range of tasks including I2V/V2V editing, camera control, and spatial object editing. Extensive experiments demonstrate that FlexAM achieves superior performance across all evaluated tasks.",
        "url": "http://arxiv.org/abs/2602.13185v1",
        "published_date": "2026-02-13T18:52:11+00:00",
        "updated_date": "2026-02-13T18:52:11+00:00",
        "categories": [
            "cs.CV",
            "cs.GR"
        ],
        "authors": [
            "Mingzhi Sheng",
            "Zekai Gu",
            "Peng Li",
            "Cheng Lin",
            "Hao-Xiang Guo",
            "Ying-Cong Chen",
            "Yuan Liu"
        ],
        "tldr": "The paper introduces FlexAM, a framework for video generation that disentangles appearance and motion using a novel 3D control signal (point cloud with positional encodings) to achieve versatile video editing and control.",
        "tldr_zh": "该论文介绍了FlexAM，一个视频生成框架，它使用一种新颖的3D控制信号（具有位置编码的点云）来分离外观和运动，从而实现通用的视频编辑与控制功能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]