[
    {
        "title": "PackCache: A Training-Free Acceleration Method for Unified Autoregressive Video Generation via Compact KV-Cache",
        "summary": "A unified autoregressive model is a Transformer-based framework that addresses diverse multimodal tasks (e.g., text, image, video) as a single sequence modeling problem under a shared token space. Such models rely on the KV-cache mechanism to reduce attention computation from O(T^2) to O(T); however, KV-cache size grows linearly with the number of generated tokens, and it rapidly becomes the dominant bottleneck limiting inference efficiency and generative length. Unified autoregressive video generation inherits this limitation. Our analysis reveals that KV-cache tokens exhibit distinct spatiotemporal properties: (i) text and conditioning-image tokens act as persistent semantic anchors that consistently receive high attention, and (ii) attention to previous frames naturally decays with temporal distance. Leveraging these observations, we introduce PackCache, a training-free KV-cache management method that dynamically compacts the KV cache through three coordinated mechanisms: condition anchoring that preserves semantic references, cross-frame decay modeling that allocates cache budget according to temporal distance, and spatially preserving position embedding that maintains coherent 3D structure under cache removal. In terms of efficiency, PackCache accelerates end-to-end generation by 1.7-2.2x on 48-frame long sequences, showcasing its strong potential for enabling longer-sequence video generation. Notably, the final four frames - the portion most impacted by the progressively expanding KV-cache and thus the most expensive segment of the clip - PackCache delivers a 2.6x and 3.7x acceleration on A40 and H200, respectively, for 48-frame videos.",
        "url": "http://arxiv.org/abs/2601.04359v1",
        "published_date": "2026-01-07T19:51:06+00:00",
        "updated_date": "2026-01-07T19:51:06+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Kunyang Li",
            "Mubarak Shah",
            "Yuzhang Shang"
        ],
        "tldr": "The paper introduces PackCache, a training-free method for accelerating autoregressive video generation by dynamically compacting the KV-cache, leading to significant speedups, especially for longer sequences.",
        "tldr_zh": "本文介绍了一种名为PackCache的无需训练的方法，通过动态压缩KV缓存来加速自回归视频生成，从而显著提高速度，尤其是在较长的序列中。",
        "relevance_score": 10,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    },
    {
        "title": "Diffusion-DRF: Differentiable Reward Flow for Video Diffusion Fine-Tuning",
        "summary": "Direct Preference Optimization (DPO) has recently improved Text-to-Video (T2V) generation by enhancing visual fidelity and text alignment. However, current methods rely on non-differentiable preference signals from human annotations or learned reward models. This reliance makes training label-intensive, bias-prone, and easy-to-game, which often triggers reward hacking and unstable training. We propose Diffusion-DRF, a differentiable reward flow for fine-tuning video diffusion models using a frozen, off-the-shelf Vision-Language Model (VLM) as a training-free critic. Diffusion-DRF directly backpropagates VLM feedback through the diffusion denoising chain, converting logit-level responses into token-aware gradients for optimization. We propose an automated, aspect-structured prompting pipeline to obtain reliable multi-dimensional VLM feedback, while gradient checkpointing enables efficient updates through the final denoising steps. Diffusion-DRF improves video quality and semantic alignment while mitigating reward hacking and collapse -- without additional reward models or preference datasets. It is model-agnostic and readily generalizes to other diffusion-based generative tasks.",
        "url": "http://arxiv.org/abs/2601.04153v1",
        "published_date": "2026-01-07T18:05:08+00:00",
        "updated_date": "2026-01-07T18:05:08+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yifan Wang",
            "Yanyu Li",
            "Sergey Tulyakov",
            "Yun Fu",
            "Anil Kag"
        ],
        "tldr": "The paper introduces Diffusion-DRF, a method for fine-tuning video diffusion models using a differentiable reward flow derived from a frozen VLM, avoiding the need for human annotations or learned reward models and mitigating reward hacking.",
        "tldr_zh": "该论文介绍了Diffusion-DRF，一种使用来自冻结的VLM的可微奖励流来微调视频扩散模型的方法，避免了对人工标注或学习奖励模型的需求，并减轻了奖励攻击。",
        "relevance_score": 10,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    },
    {
        "title": "Klear: Unified Multi-Task Audio-Video Joint Generation",
        "summary": "Audio-video joint generation has progressed rapidly, yet substantial challenges still remain. Non-commercial approaches still suffer audio-visual asynchrony, poor lip-speech alignment, and unimodal degradation, which can be stemmed from weak audio-visual correspondence modeling, limited generalization, and scarce high-quality dense-caption data. To address these issues, we introduce Klear and delve into three axes--model architecture, training strategy, and data curation. Architecturally, we adopt a single-tower design with unified DiT blocks and an Omni-Full Attention mechanism, achieving tight audio-visual alignment and strong scalability. Training-wise, we adopt a progressive multitask regime--random modality masking to joint optimization across tasks, and a multistage curriculum, yielding robust representations, strengthening A-V aligned world knowledge, and preventing unimodal collapse. For datasets, we present the first large-scale audio-video dataset with dense captions, and introduce a novel automated data-construction pipeline which annotates and filters millions of diverse, high-quality, strictly aligned audio-video-caption triplets. Building on this, Klear scales to large datasets, delivering high-fidelity, semantically and temporally aligned, instruction-following generation in both joint and unimodal settings while generalizing robustly to out-of-distribution scenarios. Across tasks, it substantially outperforms prior methods by a large margin and achieves performance comparable to Veo 3, offering a unified, scalable path toward next-generation audio-video synthesis.",
        "url": "http://arxiv.org/abs/2601.04151v1",
        "published_date": "2026-01-07T18:03:45+00:00",
        "updated_date": "2026-01-07T18:03:45+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.MM",
            "cs.SD"
        ],
        "authors": [
            "Jun Wang",
            "Chunyu Qiang",
            "Yuxin Guo",
            "Yiran Wang",
            "Xijuan Zeng",
            "Chen Zhang",
            "Pengfei Wan"
        ],
        "tldr": "The paper introduces Klear, a unified multi-task audio-video joint generation model with a novel architecture, training strategy, and a large-scale dataset with dense captions, achieving state-of-the-art performance and generalization.",
        "tldr_zh": "该论文介绍了Klear，一个统一的多任务音视频联合生成模型，具有新颖的架构、训练策略和一个带有密集字幕的大规模数据集，实现了最先进的性能和泛化能力。",
        "relevance_score": 10,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    },
    {
        "title": "Multi-Scale Local Speculative Decoding for Image Generation",
        "summary": "Autoregressive (AR) models have achieved remarkable success in image synthesis, yet their sequential nature imposes significant latency constraints. Speculative Decoding offers a promising avenue for acceleration, but existing approaches are limited by token-level ambiguity and lack of spatial awareness. In this work, we introduce Multi-Scale Local Speculative Decoding (MuLo-SD), a novel framework that combines multi-resolution drafting with spatially informed verification to accelerate AR image generation. Our method leverages a low-resolution drafter paired with learned up-samplers to propose candidate image tokens, which are then verified in parallel by a high-resolution target model. Crucially, we incorporate a local rejection and resampling mechanism, enabling efficient correction of draft errors by focusing on spatial neighborhoods rather than raster-scan resampling after the first rejection. We demonstrate that MuLo-SD achieves substantial speedups - up to $\\mathbf{1.7\\times}$ - outperforming strong speculative decoding baselines such as EAGLE-2 and LANTERN in terms of acceleration, while maintaining comparable semantic alignment and perceptual quality. These results are validated using GenEval, DPG-Bench, and FID/HPSv2 on the MS-COCO 5k validation split. Extensive ablations highlight the impact of up-sampling design, probability pooling, and local rejection and resampling with neighborhood expansion. Our approach sets a new state-of-the-art in speculative decoding for image synthesis, bridging the gap between efficiency and fidelity.",
        "url": "http://arxiv.org/abs/2601.05149v1",
        "published_date": "2026-01-08T17:39:35+00:00",
        "updated_date": "2026-01-08T17:39:35+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Elia Peruzzo",
            "Guillaume Sautière",
            "Amirhossein Habibian"
        ],
        "tldr": "The paper introduces Multi-Scale Local Speculative Decoding (MuLo-SD), a novel approach to accelerate autoregressive image generation by integrating multi-resolution drafting with spatially informed verification, achieving significant speedups while maintaining image quality.",
        "tldr_zh": "本文介绍了一种名为多尺度局部推测解码 (MuLo-SD) 的新方法，通过整合多分辨率草图绘制和空间信息验证来加速自回归图像生成，在保持图像质量的同时实现了显著的加速。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "VerseCrafter: Dynamic Realistic Video World Model with 4D Geometric Control",
        "summary": "Video world models aim to simulate dynamic, real-world environments, yet existing methods struggle to provide unified and precise control over camera and multi-object motion, as videos inherently operate dynamics in the projected 2D image plane. To bridge this gap, we introduce VerseCrafter, a 4D-aware video world model that enables explicit and coherent control over both camera and object dynamics within a unified 4D geometric world state. Our approach is centered on a novel 4D Geometric Control representation, which encodes the world state through a static background point cloud and per-object 3D Gaussian trajectories. This representation captures not only an object's path but also its probabilistic 3D occupancy over time, offering a flexible, category-agnostic alternative to rigid bounding boxes or parametric models. These 4D controls are rendered into conditioning signals for a pretrained video diffusion model, enabling the generation of high-fidelity, view-consistent videos that precisely adhere to the specified dynamics. Unfortunately, another major challenge lies in the scarcity of large-scale training data with explicit 4D annotations. We address this by developing an automatic data engine that extracts the required 4D controls from in-the-wild videos, allowing us to train our model on a massive and diverse dataset.",
        "url": "http://arxiv.org/abs/2601.05138v1",
        "published_date": "2026-01-08T17:28:52+00:00",
        "updated_date": "2026-01-08T17:28:52+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Sixiao Zheng",
            "Minghao Yin",
            "Wenbo Hu",
            "Xiaoyu Li",
            "Ying Shan",
            "Yanwei Fu"
        ],
        "tldr": "VerseCrafter introduces a 4D-aware video world model that enables explicit control over camera and object dynamics using a novel 4D Geometric Control representation and a large-scale data engine for training.",
        "tldr_zh": "VerseCrafter提出了一个4D感知的视频世界模型，它通过一种新的4D几何控制表示和用于训练的大规模数据引擎，实现了对相机和物体动态的显式控制。",
        "relevance_score": 9,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Re-Align: Structured Reasoning-guided Alignment for In-Context Image Generation and Editing",
        "summary": "In-context image generation and editing (ICGE) enables users to specify visual concepts through interleaved image-text prompts, demanding precise understanding and faithful execution of user intent. Although recent unified multimodal models exhibit promising understanding capabilities, these strengths often fail to transfer effectively to image generation. We introduce Re-Align, a unified framework that bridges the gap between understanding and generation through structured reasoning-guided alignment. At its core lies the In-Context Chain-of-Thought (IC-CoT), a structured reasoning paradigm that decouples semantic guidance and reference association, providing clear textual target and mitigating confusion among reference images. Furthermore, Re-Align introduces an effective RL training scheme that leverages a surrogate reward to measure the alignment between structured reasoning text and the generated image, thereby improving the model's overall performance on ICGE tasks. Extensive experiments verify that Re-Align outperforms competitive methods of comparable model scale and resources on both in-context image generation and editing tasks.",
        "url": "http://arxiv.org/abs/2601.05124v1",
        "published_date": "2026-01-08T17:13:00+00:00",
        "updated_date": "2026-01-08T17:13:00+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Runze He",
            "Yiji Cheng",
            "Tiankai Hang",
            "Zhimin Li",
            "Yu Xu",
            "Zijin Yin",
            "Shiyi Zhang",
            "Wenxun Dai",
            "Penghui Du",
            "Ao Ma",
            "Chunyu Wang",
            "Qinglin Lu",
            "Jizhong Han",
            "Jiao Dai"
        ],
        "tldr": "The paper introduces Re-Align, a structured reasoning-guided framework for in-context image generation and editing that uses In-Context Chain-of-Thought (IC-CoT) and Reinforcement Learning to improve alignment between text prompts and generated images.",
        "tldr_zh": "该论文介绍了 Re-Align，一个结构化推理引导的上下文图像生成和编辑框架，它使用上下文链式思考 (IC-CoT) 和强化学习来提高文本提示和生成图像之间的一致性。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Forge-and-Quench: Enhancing Image Generation for Higher Fidelity in Unified Multimodal Models",
        "summary": "Integrating image generation and understanding into a single framework has become a pivotal goal in the multimodal domain. However, how understanding can effectively assist generation has not been fully explored. Unlike previous works that focus on leveraging reasoning abilities and world knowledge from understanding models, this paper introduces a novel perspective: leveraging understanding to enhance the fidelity and detail richness of generated images. To this end, we propose Forge-and-Quench, a new unified framework that puts this principle into practice. In the generation process of our framework, an MLLM first reasons over the entire conversational context, including text instructions, to produce an enhanced text instruction. This refined instruction is then mapped to a virtual visual representation, termed the Bridge Feature, via a novel Bridge Adapter. This feature acts as a crucial link, forging insights from the understanding model to quench and refine the generation process. It is subsequently injected into the T2I backbone as a visual guidance signal, alongside the enhanced text instruction that replaces the original input. To validate this paradigm, we conduct comprehensive studies on the design of the Bridge Feature and Bridge Adapter. Our framework demonstrates exceptional extensibility and flexibility, enabling efficient migration across different MLLM and T2I models with significant savings in training overhead, all without compromising the MLLM's inherent multimodal understanding capabilities. Experiments show that Forge-and-Quench significantly improves image fidelity and detail across multiple models, while also maintaining instruction-following accuracy and enhancing world knowledge application. Models and codes are available at https://github.com/YanbingZeng/Forge-and-Quench.",
        "url": "http://arxiv.org/abs/2601.04706v1",
        "published_date": "2026-01-08T08:18:44+00:00",
        "updated_date": "2026-01-08T08:18:44+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yanbing Zeng",
            "Jia Wang",
            "Hanghang Ma",
            "Junqiang Wu",
            "Jie Zhu",
            "Xiaoming Wei",
            "Jie Hu"
        ],
        "tldr": "The paper introduces Forge-and-Quench, a novel framework that leverages multimodal understanding to enhance image generation fidelity by using the understanding model to refine the generation process through a Bridge Feature acting as a visual guidance signal.",
        "tldr_zh": "该论文介绍了一种名为 Forge-and-Quench 的新型框架，该框架通过利用多模态理解以增强图像生成的保真度，通过使用理解模型，借助作为视觉指导信号的 Bridge Feature 来细化生成过程。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "IGenBench: Benchmarking the Reliability of Text-to-Infographic Generation",
        "summary": "Infographics are composite visual artifacts that combine data visualizations with textual and illustrative elements to communicate information. While recent text-to-image (T2I) models can generate aesthetically appealing images, their reliability in generating infographics remains unclear. Generated infographics may appear correct at first glance but contain easily overlooked issues, such as distorted data encoding or incorrect textual content. We present IGENBENCH, the first benchmark for evaluating the reliability of text-to-infographic generation, comprising 600 curated test cases spanning 30 infographic types. We design an automated evaluation framework that decomposes reliability verification into atomic yes/no questions based on a taxonomy of 10 question types. We employ multimodal large language models (MLLMs) to verify each question, yielding question-level accuracy (Q-ACC) and infographic-level accuracy (I-ACC). We comprehensively evaluate 10 state-of-the-art T2I models on IGENBENCH. Our systematic analysis reveals key insights for future model development: (i) a three-tier performance hierarchy with the top model achieving Q-ACC of 0.90 but I-ACC of only 0.49; (ii) data-related dimensions emerging as universal bottlenecks (e.g., Data Completeness: 0.21); and (iii) the challenge of achieving end-to-end correctness across all models. We release IGENBENCH at https://igen-bench.vercel.app/.",
        "url": "http://arxiv.org/abs/2601.04498v1",
        "published_date": "2026-01-08T02:06:53+00:00",
        "updated_date": "2026-01-08T02:06:53+00:00",
        "categories": [
            "cs.LG",
            "cs.CV"
        ],
        "authors": [
            "Yinghao Tang",
            "Xueding Liu",
            "Boyuan Zhang",
            "Tingfeng Lan",
            "Yupeng Xie",
            "Jiale Lao",
            "Yiyao Wang",
            "Haoxuan Li",
            "Tingting Gao",
            "Bo Pan",
            "Luoxuan Weng",
            "Xiuqi Huang",
            "Minfeng Zhu",
            "Yingchaojie Feng",
            "Yuyu Luo",
            "Wei Chen"
        ],
        "tldr": "The paper introduces IGENBENCH, a new benchmark for evaluating the reliability of text-to-infographic generation models, revealing significant challenges in data encoding and overall correctness.",
        "tldr_zh": "该论文介绍了IGENBENCH，一个新的用于评估文本到信息图生成模型可靠性的基准。研究结果揭示了数据编码和整体正确性方面的重大挑战。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 10,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "ReHyAt: Recurrent Hybrid Attention for Video Diffusion Transformers",
        "summary": "Recent advances in video diffusion models have shifted towards transformer-based architectures, achieving state-of-the-art video generation but at the cost of quadratic attention complexity, which severely limits scalability for longer sequences. We introduce ReHyAt, a Recurrent Hybrid Attention mechanism that combines the fidelity of softmax attention with the efficiency of linear attention, enabling chunk-wise recurrent reformulation and constant memory usage. Unlike the concurrent linear-only SANA Video, ReHyAt's hybrid design allows efficient distillation from existing softmax-based models, reducing the training cost by two orders of magnitude to ~160 GPU hours, while being competitive in the quality. Our light-weight distillation and finetuning pipeline provides a recipe that can be applied to future state-of-the-art bidirectional softmax-based models. Experiments on VBench and VBench-2.0, as well as a human preference study, demonstrate that ReHyAt achieves state-of-the-art video quality while reducing attention cost from quadratic to linear, unlocking practical scalability for long-duration and on-device video generation. Project page is available at https://qualcomm-ai-research.github.io/rehyat.",
        "url": "http://arxiv.org/abs/2601.04342v1",
        "published_date": "2026-01-07T19:26:30+00:00",
        "updated_date": "2026-01-07T19:26:30+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Mohsen Ghafoorian",
            "Amirhossein Habibian"
        ],
        "tldr": "The paper introduces ReHyAt, a recurrent hybrid attention mechanism for video diffusion transformers that reduces computational complexity from quadratic to linear while maintaining state-of-the-art video quality through efficient distillation from softmax-based models.",
        "tldr_zh": "该论文介绍了一种名为ReHyAt的循环混合注意力机制，用于视频扩散Transformers，通过从softmax模型中高效蒸馏，将计算复杂度从二次降低到线性，同时保持了最先进的视频质量。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Unified Text-Image Generation with Weakness-Targeted Post-Training",
        "summary": "Unified multimodal generation architectures that jointly produce text and images have recently emerged as a promising direction for text-to-image (T2I) synthesis. However, many existing systems rely on explicit modality switching, generating reasoning text before switching manually to image generation. This separate, sequential inference process limits cross-modal coupling and prohibits automatic multimodal generation. This work explores post-training to achieve fully unified text-image generation, where models autonomously transition from textual reasoning to visual synthesis within a single inference process. We examine the impact of joint text-image generation on T2I performance and the relative importance of each modality during post-training. We additionally explore different post-training data strategies, showing that a targeted dataset addressing specific limitations achieves superior results compared to broad image-caption corpora or benchmark-aligned data. Using offline, reward-weighted post-training with fully self-generated synthetic data, our approach enables improvements in multimodal image generation across four diverse T2I benchmarks, demonstrating the effectiveness of reward-weighting both modalities and strategically designed post-training data.",
        "url": "http://arxiv.org/abs/2601.04339v1",
        "published_date": "2026-01-07T19:19:44+00:00",
        "updated_date": "2026-01-07T19:19:44+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Jiahui Chen",
            "Philippe Hansen-Estruch",
            "Xiaochuang Han",
            "Yushi Hu",
            "Emily Dinan",
            "Amita Kamath",
            "Michal Drozdzal",
            "Reyhane Askari-Hemmat",
            "Luke Zettlemoyer",
            "Marjan Ghazvininejad"
        ],
        "tldr": "This paper presents a post-training method for unified text-image generation models that allows for autonomous transitions between text and image generation during inference, improving performance on T2I benchmarks through strategically designed synthetic data and reward-weighted training.",
        "tldr_zh": "本文提出了一种统一的文本-图像生成模型的后训练方法，该方法允许在推理过程中自动在文本和图像生成之间转换，并通过策略性设计的合成数据和奖励加权训练，提高了 T2I 基准的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Choreographing a World of Dynamic Objects",
        "summary": "Dynamic objects in our physical 4D (3D + time) world are constantly evolving, deforming, and interacting with other objects, leading to diverse 4D scene dynamics. In this paper, we present a universal generative pipeline, CHORD, for CHOReographing Dynamic objects and scenes and synthesizing this type of phenomena. Traditional rule-based graphics pipelines to create these dynamics are based on category-specific heuristics, yet are labor-intensive and not scalable. Recent learning-based methods typically demand large-scale datasets, which may not cover all object categories in interest. Our approach instead inherits the universality from the video generative models by proposing a distillation-based pipeline to extract the rich Lagrangian motion information hidden in the Eulerian representations of 2D videos. Our method is universal, versatile, and category-agnostic. We demonstrate its effectiveness by conducting experiments to generate a diverse range of multi-body 4D dynamics, show its advantage compared to existing methods, and demonstrate its applicability in generating robotics manipulation policies. Project page: https://yanzhelyu.github.io/chord",
        "url": "http://arxiv.org/abs/2601.04194v1",
        "published_date": "2026-01-07T18:59:40+00:00",
        "updated_date": "2026-01-07T18:59:40+00:00",
        "categories": [
            "cs.CV",
            "cs.GR",
            "cs.RO"
        ],
        "authors": [
            "Yanzhe Lyu",
            "Chen Geng",
            "Karthik Dharmarajan",
            "Yunzhi Zhang",
            "Hadi Alzayer",
            "Shangzhe Wu",
            "Jiajun Wu"
        ],
        "tldr": "The paper introduces CHORD, a novel distillation-based pipeline that leverages video generative models to synthesize diverse 4D dynamics without relying on category-specific heuristics or large-scale datasets, demonstrating its effectiveness in multi-body dynamics generation and robotics manipulation.",
        "tldr_zh": "该论文介绍了一种名为CHORD的新颖的基于提炼的流程，它利用视频生成模型来合成多样化的4D动态，而无需依赖于特定于类别的启发式方法或大型数据集，从而证明了其在多体动力学生成和机器人操作方面的有效性。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Beyond Binary Preference: Aligning Diffusion Models to Fine-grained Criteria by Decoupling Attributes",
        "summary": "Post-training alignment of diffusion models relies on simplified signals, such as scalar rewards or binary preferences. This limits alignment with complex human expertise, which is hierarchical and fine-grained. To address this, we first construct a hierarchical, fine-grained evaluation criteria with domain experts, which decomposes image quality into multiple positive and negative attributes organized in a tree structure. Building on this, we propose a two-stage alignment framework. First, we inject domain knowledge to an auxiliary diffusion model via Supervised Fine-Tuning. Second, we introduce Complex Preference Optimization (CPO) that extends DPO to align the target diffusion to our non-binary, hierarchical criteria. Specifically, we reformulate the alignment problem to simultaneously maximize the probability of positive attributes while minimizing the probability of negative attributes with the auxiliary diffusion. We instantiate our approach in the domain of painting generation and conduct CPO training with an annotated dataset of painting with fine-grained attributes based on our criteria. Extensive experiments demonstrate that CPO significantly enhances generation quality and alignment with expertise, opening new avenues for fine-grained criteria alignment.",
        "url": "http://arxiv.org/abs/2601.04300v1",
        "published_date": "2026-01-07T18:11:22+00:00",
        "updated_date": "2026-01-07T18:11:22+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Chenye Meng",
            "Zejian Li",
            "Zhongni Liu",
            "Yize Li",
            "Changle Xie",
            "Kaixin Jia",
            "Ling Yang",
            "Huanghuang Deng",
            "Shiying Ding",
            "Shengyuan Zhang",
            "Jiayi Li",
            "Lingyun Sun"
        ],
        "tldr": "This paper introduces a two-stage alignment framework, Complex Preference Optimization (CPO), to align diffusion models with fine-grained, hierarchical evaluation criteria, demonstrating improved generation quality in painting generation.",
        "tldr_zh": "该论文介绍了一种两阶段对齐框架，即复杂偏好优化（CPO），以使扩散模型与细粒度、分层评估标准对齐，并在绘画生成中展示了改进的生成质量。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "MiLDEdit: Reasoning-Based Multi-Layer Design Document Editing",
        "summary": "Real-world design documents (e.g., posters) are inherently multi-layered, combining decoration, text, and images. Editing them from natural-language instructions requires fine-grained, layer-aware reasoning to identify relevant layers and coordinate modifications. Prior work largely overlooks multi-layer design document editing, focusing instead on single-layer image editing or multi-layer generation, which assume a flat canvas and lack the reasoning needed to determine what and where to modify. To address this gap, we introduce the Multi-Layer Document Editing Agent (MiLDEAgent), a reasoning-based framework that combines an RL-trained multimodal reasoner for layer-wise understanding with an image editor for targeted modifications. To systematically benchmark this setting, we introduce the MiLDEBench, a human-in-the-loop corpus of over 20K design documents paired with diverse editing instructions. The benchmark is complemented by a task-specific evaluation protocol, MiLDEEval, which spans four dimensions including instruction following, layout consistency, aesthetics, and text rendering. Extensive experiments on 14 open-source and 2 closed-source models reveal that existing approaches fail to generalize: open-source models often cannot complete multi-layer document editing tasks, while closed-source models suffer from format violations. In contrast, MiLDEAgent achieves strong layer-aware reasoning and precise editing, significantly outperforming all open-source baselines and attaining performance comparable to closed-source models, thereby establishing the first strong baseline for multi-layer document editing.",
        "url": "http://arxiv.org/abs/2601.04589v1",
        "published_date": "2026-01-08T04:38:07+00:00",
        "updated_date": "2026-01-08T04:38:07+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Zihao Lin",
            "Wanrong Zhu",
            "Jiuxiang Gu",
            "Jihyung Kil",
            "Christopher Tensmeyer",
            "Lin Zhang",
            "Shilong Liu",
            "Ruiyi Zhang",
            "Lifu Huang",
            "Vlad I. Morariu",
            "Tong Sun"
        ],
        "tldr": "This paper introduces MiLDEAgent, a reasoning-based framework for editing multi-layer design documents from natural language instructions, along with a new benchmark MiLDEBench and evaluation protocol MiLDEEval. The proposed agent outperforms existing open-source models and achieves comparable performance to closed-source models.",
        "tldr_zh": "该论文介绍了MiLDEAgent，一个基于推理的框架，用于根据自然语言指令编辑多层设计文档，并提出了一个新的基准MiLDEBench和评估协议MiLDEEval。所提出的智能体优于现有的开源模型，并达到了与闭源模型相当的性能。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "3D Conditional Image Synthesis of Left Atrial LGE MRI from Composite Semantic Masks",
        "summary": "Segmentation of the left atrial (LA) wall and endocardium from late gadolinium-enhanced (LGE) MRI is essential for quantifying atrial fibrosis in patients with atrial fibrillation. The development of accurate machine learning-based segmentation models remains challenging due to the limited availability of data and the complexity of anatomical structures. In this work, we investigate 3D conditional generative models as potential solution for augmenting scarce LGE training data and improving LA segmentation performance. We develop a pipeline to synthesize high-fidelity 3D LGE MRI volumes from composite semantic label maps combining anatomical expert annotations with unsupervised tissue clusters, using three 3D conditional generators (Pix2Pix GAN, SPADE-GAN, and SPADE-LDM). The synthetic images are evaluated for realism and their impact on downstream LA segmentation. SPADE-LDM generates the most realistic and structurally accurate images, achieving an FID of 4.063 and surpassing GAN models, which have FIDs of 40.821 and 7.652 for Pix2Pix and SPADE-GAN, respectively. When augmented with synthetic LGE images, the Dice score for LA cavity segmentation with a 3D U-Net model improved from 0.908 to 0.936, showing a statistically significant improvement (p < 0.05) over the baseline.These findings demonstrate the potential of label-conditioned 3D synthesis to enhance the segmentation of under-represented cardiac structures.",
        "url": "http://arxiv.org/abs/2601.04588v1",
        "published_date": "2026-01-08T04:35:40+00:00",
        "updated_date": "2026-01-08T04:35:40+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yusri Al-Sanaani",
            "Rebecca Thornhill",
            "Sreeraman Rajan"
        ],
        "tldr": "This paper explores 3D conditional generative models (Pix2Pix GAN, SPADE-GAN, SPADE-LDM) to synthesize LGE MRI images from semantic label maps for improving LA segmentation, showing SPADE-LDM achieving the best performance for image generation and segmentation improvement.",
        "tldr_zh": "本文探索了3D条件生成模型（Pix2Pix GAN、SPADE-GAN、SPADE-LDM），通过语义标签图合成左心房延迟钆增强MRI图像，以提高左心房分割效果，结果显示SPADE-LDM在图像生成和分割效果提升方面表现最佳。",
        "relevance_score": 8,
        "novelty_claim_score": 6,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Integrated Framework for Selecting and Enhancing Ancient Marathi Inscription Images from Stone, Metal Plate, and Paper Documents",
        "summary": "Ancient script images often suffer from severe background noise, low contrast, and degradation caused by aging and environmental effects. In many cases, the foreground text and background exhibit similar visual characteristics, making the inscriptions difficult to read. The primary objective of image enhancement is to improve the readability of such degraded ancient images. This paper presents an image enhancement approach based on binarization and complementary preprocessing techniques for removing stains and enhancing unclear ancient text. The proposed methods are evaluated on different types of ancient scripts, including inscriptions on stone, metal plates, and historical documents. Experimental results show that the proposed approach achieves classification accuracies of 55.7%, 62%, and 65.6% for stone, metal plate, and document scripts, respectively, using the K-Nearest Neighbor (K-NN) classifier. Using the Support Vector Machine (SVM) classifier, accuracies of 53.2%, 59.5%, and 67.8% are obtained. The results demonstrate the effectiveness of the proposed enhancement method in improving the readability of ancient Marathi inscription images.",
        "url": "http://arxiv.org/abs/2601.04800v1",
        "published_date": "2026-01-08T10:30:59+00:00",
        "updated_date": "2026-01-08T10:30:59+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Bapu D. Chendage",
            "Rajivkumar S. Mente"
        ],
        "tldr": "This paper presents an image enhancement approach for ancient Marathi script images using binarization and preprocessing techniques, achieving moderate classification accuracies using K-NN and SVM classifiers.",
        "tldr_zh": "本文提出了一种使用二值化和预处理技术来增强古代马拉地文字图像的方法，使用 K-NN 和 SVM 分类器实现了中等的分类精度。",
        "relevance_score": 2,
        "novelty_claim_score": 4,
        "clarity_score": 8,
        "potential_impact_score": 5,
        "overall_priority_score": 3
    }
]