[
    {
        "title": "Generated Reality: Human-centric World Simulation using Interactive Video Generation with Hand and Camera Control",
        "summary": "Extended reality (XR) demands generative models that respond to users' tracked real-world motion, yet current video world models accept only coarse control signals such as text or keyboard input, limiting their utility for embodied interaction. We introduce a human-centric video world model that is conditioned on both tracked head pose and joint-level hand poses. For this purpose, we evaluate existing diffusion transformer conditioning strategies and propose an effective mechanism for 3D head and hand control, enabling dexterous hand--object interactions. We train a bidirectional video diffusion model teacher using this strategy and distill it into a causal, interactive system that generates egocentric virtual environments. We evaluate this generated reality system with human subjects and demonstrate improved task performance as well as a significantly higher level of perceived amount of control over the performed actions compared with relevant baselines.",
        "url": "http://arxiv.org/abs/2602.18422v1",
        "published_date": "2026-02-20T18:45:29+00:00",
        "updated_date": "2026-02-20T18:45:29+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Linxi Xie",
            "Lisong C. Sun",
            "Ashley Neall",
            "Tong Wu",
            "Shengqu Cai",
            "Gordon Wetzstein"
        ],
        "tldr": "This paper introduces a human-centric video world model that generates interactive, egocentric virtual environments conditioned on head and hand tracking data, demonstrating improved task performance and user control in XR applications.",
        "tldr_zh": "本文提出了一种以人为中心的视频世界模型，该模型基于头部和手部跟踪数据生成交互式、以自我为中心的虚拟环境，展示了在XR应用中改进的任务性能和用户控制。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8.5
    },
    {
        "title": "The Geometry of Noise: Why Diffusion Models Don't Need Noise Conditioning",
        "summary": "Autonomous (noise-agnostic) generative models, such as Equilibrium Matching and blind diffusion, challenge the standard paradigm by learning a single, time-invariant vector field that operates without explicit noise-level conditioning. While recent work suggests that high-dimensional concentration allows these models to implicitly estimate noise levels from corrupted observations, a fundamental paradox remains: what is the underlying landscape being optimized when the noise level is treated as a random variable, and how can a bounded, noise-agnostic network remain stable near the data manifold where gradients typically diverge? We resolve this paradox by formalizing Marginal Energy, $E_{\\text{marg}}(\\mathbf{u}) = -\\log p(\\mathbf{u})$, where $p(\\mathbf{u}) = \\int p(\\mathbf{u}|t)p(t)dt$ is the marginal density of the noisy data integrated over a prior distribution of unknown noise levels. We prove that generation using autonomous models is not merely blind denoising, but a specific form of Riemannian gradient flow on this Marginal Energy. Through a novel relative energy decomposition, we demonstrate that while the raw Marginal Energy landscape possesses a $1/t^p$ singularity normal to the data manifold, the learned time-invariant field implicitly incorporates a local conformal metric that perfectly counteracts the geometric singularity, converting an infinitely deep potential well into a stable attractor. We also establish the structural stability conditions for sampling with autonomous models. We identify a ``Jensen Gap'' in noise-prediction parameterizations that acts as a high-gain amplifier for estimation errors, explaining the catastrophic failure observed in deterministic blind models. Conversely, we prove that velocity-based parameterizations are inherently stable because they satisfy a bounded-gain condition that absorbs posterior uncertainty into a smooth geometric drift.",
        "url": "http://arxiv.org/abs/2602.18428v1",
        "published_date": "2026-02-20T18:49:00+00:00",
        "updated_date": "2026-02-20T18:49:00+00:00",
        "categories": [
            "cs.LG",
            "cs.CV",
            "eess.IV"
        ],
        "authors": [
            "Mojtaba Sahraee-Ardakan",
            "Mauricio Delbracio",
            "Peyman Milanfar"
        ],
        "tldr": "This paper provides a theoretical analysis of noise-agnostic diffusion models, demonstrating that they perform Riemannian gradient flow on a 'Marginal Energy' landscape and achieve stability through implicit geometric adaptations, offering insights into the failure modes of deterministic blind models.",
        "tldr_zh": "本文对噪声无关扩散模型进行了理论分析，证明它们在“边缘能量”景观上执行黎曼梯度流，并通过隐式几何调整实现稳定性，并深入了解确定性盲模型的失效模式。",
        "relevance_score": 7,
        "novelty_claim_score": 9,
        "clarity_score": 7,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]