[
    {
        "title": "SeeThrough3D: Occlusion Aware 3D Control in Text-to-Image Generation",
        "summary": "We identify occlusion reasoning as a fundamental yet overlooked aspect for 3D layout-conditioned generation. It is essential for synthesizing partially occluded objects with depth-consistent geometry and scale. While existing methods can generate realistic scenes that follow input layouts, they often fail to model precise inter-object occlusions. We propose SeeThrough3D, a model for 3D layout conditioned generation that explicitly models occlusions. We introduce an occlusion-aware 3D scene representation (OSCR), where objects are depicted as translucent 3D boxes placed within a virtual environment and rendered from desired camera viewpoint. The transparency encodes hidden object regions, enabling the model to reason about occlusions, while the rendered viewpoint provides explicit camera control during generation. We condition a pretrained flow based text-to-image image generation model by introducing a set of visual tokens derived from our rendered 3D representation. Furthermore, we apply masked self-attention to accurately bind each object bounding box to its corresponding textual description, enabling accurate generation of multiple objects without object attribute mixing. To train the model, we construct a synthetic dataset with diverse multi-object scenes with strong inter-object occlusions. SeeThrough3D generalizes effectively to unseen object categories and enables precise 3D layout control with realistic occlusions and consistent camera control.",
        "url": "http://arxiv.org/abs/2602.23359v1",
        "published_date": "2026-02-26T18:59:05+00:00",
        "updated_date": "2026-02-26T18:59:05+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Vaibhav Agrawal",
            "Rishubh Parihar",
            "Pradhaan Bhat",
            "Ravi Kiran Sarvadevabhatla",
            "R. Venkatesh Babu"
        ],
        "tldr": "The paper introduces SeeThrough3D, a novel method for 3D layout-conditioned text-to-image generation that explicitly models inter-object occlusions using an occlusion-aware 3D scene representation and masked self-attention.",
        "tldr_zh": "本文介绍了一种名为 SeeThrough3D 的新方法，用于 3D 布局条件下的文本到图像生成，该方法使用具有遮挡意识的 3D 场景表示和掩蔽自注意力机制显式地建模对象间的遮挡。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]