[
    {
        "title": "Alterbute: Editing Intrinsic Attributes of Objects in Images",
        "summary": "We introduce Alterbute, a diffusion-based method for editing an object's intrinsic attributes in an image. We allow changing color, texture, material, and even the shape of an object, while preserving its perceived identity and scene context. Existing approaches either rely on unsupervised priors that often fail to preserve identity or use overly restrictive supervision that prevents meaningful intrinsic variations. Our method relies on: (i) a relaxed training objective that allows the model to change both intrinsic and extrinsic attributes conditioned on an identity reference image, a textual prompt describing the target intrinsic attributes, and a background image and object mask defining the extrinsic context. At inference, we restrict extrinsic changes by reusing the original background and object mask, thereby ensuring that only the desired intrinsic attributes are altered; (ii) Visual Named Entities (VNEs) - fine-grained visual identity categories (e.g., ''Porsche 911 Carrera'') that group objects sharing identity-defining features while allowing variation in intrinsic attributes. We use a vision-language model to automatically extract VNE labels and intrinsic attribute descriptions from a large public image dataset, enabling scalable, identity-preserving supervision. Alterbute outperforms existing methods on identity-preserving object intrinsic attribute editing.",
        "url": "http://arxiv.org/abs/2601.10714v1",
        "published_date": "2026-01-15T18:59:53+00:00",
        "updated_date": "2026-01-15T18:59:53+00:00",
        "categories": [
            "cs.CV",
            "cs.GR"
        ],
        "authors": [
            "Tal Reiss",
            "Daniel Winter",
            "Matan Cohen",
            "Alex Rav-Acha",
            "Yael Pritch",
            "Ariel Shamir",
            "Yedid Hoshen"
        ],
        "tldr": "The paper introduces Alterbute, a diffusion-based method for editing intrinsic object attributes (color, texture, shape) in images while preserving identity and context, using a relaxed training objective and Visual Named Entities for supervision.",
        "tldr_zh": "本文介绍了一种名为Alterbute的基于扩散的方法，用于编辑图像中对象的内在属性（颜色、纹理、形状），同时保留其身份和上下文。该方法采用了一种宽松的训练目标和视觉命名实体（VNE）来进行监督。",
        "relevance_score": 8,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    }
]