[
    {
        "title": "Rethinking Video Generation Model for the Embodied World",
        "summary": "Video generation models have significantly advanced embodied intelligence, unlocking new possibilities for generating diverse robot data that capture perception, reasoning, and action in the physical world. However, synthesizing high-quality videos that accurately reflect real-world robotic interactions remains challenging, and the lack of a standardized benchmark limits fair comparisons and progress. To address this gap, we introduce a comprehensive robotics benchmark, RBench, designed to evaluate robot-oriented video generation across five task domains and four distinct embodiments. It assesses both task-level correctness and visual fidelity through reproducible sub-metrics, including structural consistency, physical plausibility, and action completeness. Evaluation of 25 representative models highlights significant deficiencies in generating physically realistic robot behaviors. Furthermore, the benchmark achieves a Spearman correlation coefficient of 0.96 with human evaluations, validating its effectiveness. While RBench provides the necessary lens to identify these deficiencies, achieving physical realism requires moving beyond evaluation to address the critical shortage of high-quality training data. Driven by these insights, we introduce a refined four-stage data pipeline, resulting in RoVid-X, the largest open-source robotic dataset for video generation with 4 million annotated video clips, covering thousands of tasks and enriched with comprehensive physical property annotations. Collectively, this synergistic ecosystem of evaluation and data establishes a robust foundation for rigorous assessment and scalable training of video models, accelerating the evolution of embodied AI toward general intelligence.",
        "url": "http://arxiv.org/abs/2601.15282v1",
        "published_date": "2026-01-21T18:59:18+00:00",
        "updated_date": "2026-01-21T18:59:18+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.RO"
        ],
        "authors": [
            "Yufan Deng",
            "Zilin Pan",
            "Hongyu Zhang",
            "Xiaojie Li",
            "Ruoqing Hu",
            "Yufei Ding",
            "Yiming Zou",
            "Yan Zeng",
            "Daquan Zhou"
        ],
        "tldr": "This paper introduces RBench, a comprehensive robotics video generation benchmark, and RoVid-X, a large-scale robotic video dataset, to address the challenges of generating realistic robotic interactions and accelerate embodied AI research.",
        "tldr_zh": "该论文介绍了一个全面的机器人视频生成基准测试RBench和一个大规模的机器人视频数据集RoVid-X，旨在解决生成真实机器人交互的挑战，并加速具身人工智能的研究。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    },
    {
        "title": "ActionMesh: Animated 3D Mesh Generation with Temporal 3D Diffusion",
        "summary": "Generating animated 3D objects is at the heart of many applications, yet most advanced works are typically difficult to apply in practice because of their limited setup, their long runtime, or their limited quality. We introduce ActionMesh, a generative model that predicts production-ready 3D meshes \"in action\" in a feed-forward manner. Drawing inspiration from early video models, our key insight is to modify existing 3D diffusion models to include a temporal axis, resulting in a framework we dubbed \"temporal 3D diffusion\". Specifically, we first adapt the 3D diffusion stage to generate a sequence of synchronized latents representing time-varying and independent 3D shapes. Second, we design a temporal 3D autoencoder that translates a sequence of independent shapes into the corresponding deformations of a pre-defined reference shape, allowing us to build an animation. Combining these two components, ActionMesh generates animated 3D meshes from different inputs like a monocular video, a text description, or even a 3D mesh with a text prompt describing its animation. Besides, compared to previous approaches, our method is fast and produces results that are rig-free and topology consistent, hence enabling rapid iteration and seamless applications like texturing and retargeting. We evaluate our model on standard video-to-4D benchmarks (Consistent4D, Objaverse) and report state-of-the-art performances on both geometric accuracy and temporal consistency, demonstrating that our model can deliver animated 3D meshes with unprecedented speed and quality.",
        "url": "http://arxiv.org/abs/2601.16148v1",
        "published_date": "2026-01-22T17:41:13+00:00",
        "updated_date": "2026-01-22T17:41:13+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Remy Sabathier",
            "David Novotny",
            "Niloy J. Mitra",
            "Tom Monnier"
        ],
        "tldr": "ActionMesh is a novel temporal 3D diffusion model that generates production-ready animated 3D meshes from various inputs like video, text, or existing meshes, offering improved speed and quality compared to previous methods.",
        "tldr_zh": "ActionMesh 是一种新颖的时序 3D 扩散模型，可从视频、文本或现有网格等各种输入生成生产就绪的动画 3D 网格，与以前的方法相比，速度和质量都有所提高。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "PhysicsMind: Sim and Real Mechanics Benchmarking for Physical Reasoning and Prediction in Foundational VLMs and World Models",
        "summary": "Modern foundational Multimodal Large Language Models (MLLMs) and video world models have advanced significantly in mathematical, common-sense, and visual reasoning, but their grasp of the underlying physics remains underexplored. Existing benchmarks attempting to measure this matter rely on synthetic, Visual Question Answer templates or focus on perceptual video quality that is tangential to measuring how well the video abides by physical laws. To address this fragmentation, we introduce PhysicsMind, a unified benchmark with both real and simulation environments that evaluates law-consistent reasoning and generation over three canonical principles: Center of Mass, Lever Equilibrium, and Newton's First Law. PhysicsMind comprises two main tasks: i) VQA tasks, testing whether models can reason and determine physical quantities and values from images or short videos, and ii) Video Generation(VG) tasks, evaluating if predicted motion trajectories obey the same center-of-mass, torque, and inertial constraints as the ground truth. A broad range of recent models and video generation models is evaluated on PhysicsMind and found to rely on appearance heuristics while often violating basic mechanics. These gaps indicate that current scaling and training are still insufficient for robust physical understanding, underscoring PhysicsMind as a focused testbed for physics-aware multimodal models. Our data will be released upon acceptance.",
        "url": "http://arxiv.org/abs/2601.16007v1",
        "published_date": "2026-01-22T14:33:01+00:00",
        "updated_date": "2026-01-22T14:33:01+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Chak-Wing Mak",
            "Guanyu Zhu",
            "Boyi Zhang",
            "Hongji Li",
            "Xiaowei Chi",
            "Kevin Zhang",
            "Yichen Wu",
            "Yangfan He",
            "Chun-Kai Fan",
            "Wentao Lu",
            "Kuangzhi Ge",
            "Xinyu Fang",
            "Hongyang He",
            "Kuan Lu",
            "Tianxiang Xu",
            "Li Zhang",
            "Yongxin Ni",
            "Youhua Li",
            "Shanghang Zhang"
        ],
        "tldr": "The paper introduces PhysicsMind, a new benchmark for evaluating physical reasoning in multimodal models via VQA and video generation tasks, revealing current models' limitations in adhering to basic physics principles.",
        "tldr_zh": "该论文介绍了 PhysicsMind，这是一个新的基准，用于通过视觉问答和视频生成任务评估多模态模型中的物理推理能力，揭示了当前模型在遵循基本物理原理方面的局限性。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "EVolSplat4D: Efficient Volume-based Gaussian Splatting for 4D Urban Scene Synthesis",
        "summary": "Novel view synthesis (NVS) of static and dynamic urban scenes is essential for autonomous driving simulation, yet existing methods often struggle to balance reconstruction time with quality. While state-of-the-art neural radiance fields and 3D Gaussian Splatting approaches achieve photorealism, they often rely on time-consuming per-scene optimization. Conversely, emerging feed-forward methods frequently adopt per-pixel Gaussian representations, which lead to 3D inconsistencies when aggregating multi-view predictions in complex, dynamic environments. We propose EvolSplat4D, a feed-forward framework that moves beyond existing per-pixel paradigms by unifying volume-based and pixel-based Gaussian prediction across three specialized branches. For close-range static regions, we predict consistent geometry of 3D Gaussians over multiple frames directly from a 3D feature volume, complemented by a semantically-enhanced image-based rendering module for predicting their appearance. For dynamic actors, we utilize object-centric canonical spaces and a motion-adjusted rendering module to aggregate temporal features, ensuring stable 4D reconstruction despite noisy motion priors. Far-Field scenery is handled by an efficient per-pixel Gaussian branch to ensure full-scene coverage. Experimental results on the KITTI-360, KITTI, Waymo, and PandaSet datasets show that EvolSplat4D reconstructs both static and dynamic environments with superior accuracy and consistency, outperforming both per-scene optimization and state-of-the-art feed-forward baselines.",
        "url": "http://arxiv.org/abs/2601.15951v1",
        "published_date": "2026-01-22T13:39:29+00:00",
        "updated_date": "2026-01-22T13:39:29+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Sheng Miao",
            "Sijin Li",
            "Pan Wang",
            "Dongfeng Bai",
            "Bingbing Liu",
            "Yue Wang",
            "Andreas Geiger",
            "Yiyi Liao"
        ],
        "tldr": "EVolSplat4D is a feed-forward method for novel view synthesis of dynamic urban scenes. It unifies volume-based and pixel-based Gaussian prediction across multiple branches to achieve superior accuracy and consistency compared to existing methods.",
        "tldr_zh": "EVolSplat4D是一种用于动态城市场景新视角合成的前馈方法。它统一了基于体素的和基于像素的高斯预测，在多个分支中实现，与现有方法相比，具有更高的精度和一致性。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Beyond Visual Safety: Jailbreaking Multimodal Large Language Models for Harmful Image Generation via Semantic-Agnostic Inputs",
        "summary": "The rapid advancement of Multimodal Large Language Models (MLLMs) has introduced complex security challenges, particularly at the intersection of textual and visual safety. While existing schemes have explored the security vulnerabilities of MLLMs, the investigation into their visual safety boundaries remains insufficient. In this paper, we propose Beyond Visual Safety (BVS), a novel image-text pair jailbreaking framework specifically designed to probe the visual safety boundaries of MLLMs. BVS employs a \"reconstruction-then-generation\" strategy, leveraging neutralized visual splicing and inductive recomposition to decouple malicious intent from raw inputs, thereby leading MLLMs to be induced into generating harmful images. Experimental results demonstrate that BVS achieves a remarkable jailbreak success rate of 98.21\\% against GPT-5 (12 January 2026 release). Our findings expose critical vulnerabilities in the visual safety alignment of current MLLMs.",
        "url": "http://arxiv.org/abs/2601.15698v1",
        "published_date": "2026-01-22T06:56:27+00:00",
        "updated_date": "2026-01-22T06:56:27+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Mingyu Yu",
            "Lana Liu",
            "Zhehao Zhao",
            "Wei Wang",
            "Sujuan Qin"
        ],
        "tldr": "This paper proposes a novel framework, Beyond Visual Safety (BVS), that effectively jailbreaks Multimodal Large Language Models (MLLMs) to generate harmful images by decoupling malicious intent from inputs, achieving a high success rate against a future GPT-5 release.",
        "tldr_zh": "该论文提出了一种名为超越视觉安全（BVS）的新框架，通过将恶意意图与输入分离，有效地越狱多模态大型语言模型（MLLM）以生成有害图像，并对未来版本的GPT-5实现了很高的成功率。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Controllable Layered Image Generation for Real-World Editing",
        "summary": "Recent image generation models have shown impressive progress, yet they often struggle to yield controllable and consistent results when users attempt to edit specific elements within an existing image. Layered representations enable flexible, user-driven content creation, but existing approaches often fail to produce layers with coherent compositing relationships, and their object layers typically lack realistic visual effects such as shadows and reflections. To overcome these limitations, we propose LASAGNA, a novel, unified framework that generates an image jointly with its composing layers--a photorealistic background and a high-quality transparent foreground with compelling visual effects. Unlike prior work, LASAGNA efficiently learns correct image composition from a wide range of conditioning inputs--text prompts, foreground, background, and location masks--offering greater controllability for real-world applications. To enable this, we introduce LASAGNA-48K, a new dataset composed of clean backgrounds and RGBA foregrounds with physically grounded visual effects. We also propose LASAGNABENCH, the first benchmark for layer editing. We demonstrate that LASAGNA excels in generating highly consistent and coherent results across multiple image layers simultaneously, enabling diverse post-editing applications that accurately preserve identity and visual effects. LASAGNA-48K and LASAGNABENCH will be publicly released to foster open research in the community. The project page is https://rayjryang.github.io/LASAGNA-Page/.",
        "url": "http://arxiv.org/abs/2601.15507v1",
        "published_date": "2026-01-21T22:29:33+00:00",
        "updated_date": "2026-01-21T22:29:33+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Jinrui Yang",
            "Qing Liu",
            "Yijun Li",
            "Mengwei Ren",
            "Letian Zhang",
            "Zhe Lin",
            "Cihang Xie",
            "Yuyin Zhou"
        ],
        "tldr": "LASAGNA is a novel framework for generating layered images with controllable, consistent object layers and realistic visual effects, facilitated by the introduction of a new dataset (LASAGNA-48K) and benchmark (LASAGNABENCH).",
        "tldr_zh": "LASAGNA是一个新颖的框架，用于生成具有可控、一致的对象层和逼真视觉效果的分层图像，并通过引入一个新的数据集（LASAGNA-48K）和基准（LASAGNABENCH）来实现。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Iterative Refinement Improves Compositional Image Generation",
        "summary": "Text-to-image (T2I) models have achieved remarkable progress, yet they continue to struggle with complex prompts that require simultaneously handling multiple objects, relations, and attributes. Existing inference-time strategies, such as parallel sampling with verifiers or simply increasing denoising steps, can improve prompt alignment but remain inadequate for richly compositional settings where many constraints must be satisfied. Inspired by the success of chain-of-thought reasoning in large language models, we propose an iterative test-time strategy in which a T2I model progressively refines its generations across multiple steps, guided by feedback from a vision-language model as the critic in the loop. Our approach is simple, requires no external tools or priors, and can be flexibly applied to a wide range of image generators and vision-language models. Empirically, we demonstrate consistent gains on image generation across benchmarks: a 16.9% improvement in all-correct rate on ConceptMix (k=7), a 13.8% improvement on T2I-CompBench (3D-Spatial category) and a 12.5% improvement on Visual Jenga scene decomposition compared to compute-matched parallel sampling. Beyond quantitative gains, iterative refinement produces more faithful generations by decomposing complex prompts into sequential corrections, with human evaluators preferring our method 58.7% of the time over 41.3% for the parallel baseline. Together, these findings highlight iterative self-correction as a broadly applicable principle for compositional image generation. Results and visualizations are available at https://iterative-img-gen.github.io/",
        "url": "http://arxiv.org/abs/2601.15286v1",
        "published_date": "2026-01-21T18:59:40+00:00",
        "updated_date": "2026-01-21T18:59:40+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.LG",
            "cs.RO"
        ],
        "authors": [
            "Shantanu Jaiswal",
            "Mihir Prabhudesai",
            "Nikash Bhardwaj",
            "Zheyang Qin",
            "Amir Zadeh",
            "Chuan Li",
            "Katerina Fragkiadaki",
            "Deepak Pathak"
        ],
        "tldr": "This paper introduces an iterative refinement strategy for text-to-image generation, using a vision-language model as a critic to improve the compositional accuracy of generated images, achieving significant gains on various benchmarks.",
        "tldr_zh": "本文提出了一种用于文本到图像生成的迭代改进策略，使用视觉-语言模型作为评论员，以提高生成图像的组合准确性，并在各种基准测试中取得了显著的提升。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Walk through Paintings: Egocentric World Models from Internet Priors",
        "summary": "What if a video generation model could not only imagine a plausible future, but the correct one, accurately reflecting how the world changes with each action? We address this question by presenting the Egocentric World Model (EgoWM), a simple, architecture-agnostic method that transforms any pretrained video diffusion model into an action-conditioned world model, enabling controllable future prediction. Rather than training from scratch, we repurpose the rich world priors of Internet-scale video models and inject motor commands through lightweight conditioning layers. This allows the model to follow actions faithfully while preserving realism and strong generalization. Our approach scales naturally across embodiments and action spaces, ranging from 3-DoF mobile robots to 25-DoF humanoids, where predicting egocentric joint-angle-driven dynamics is substantially more challenging. The model produces coherent rollouts for both navigation and manipulation tasks, requiring only modest fine-tuning. To evaluate physical correctness independently of visual appearance, we introduce the Structural Consistency Score (SCS), which measures whether stable scene elements evolve consistently with the provided actions. EgoWM improves SCS by up to 80 percent over prior state-of-the-art navigation world models, while achieving up to six times lower inference latency and robust generalization to unseen environments, including navigation inside paintings.",
        "url": "http://arxiv.org/abs/2601.15284v1",
        "published_date": "2026-01-21T18:59:32+00:00",
        "updated_date": "2026-01-21T18:59:32+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Anurag Bagchi",
            "Zhipeng Bao",
            "Homanga Bharadhwaj",
            "Yu-Xiong Wang",
            "Pavel Tokmakov",
            "Martial Hebert"
        ],
        "tldr": "The paper introduces Egocentric World Model (EgoWM), a method that transforms a pretrained video diffusion model into an action-conditioned world model for controllable future prediction, showing improvements in structural consistency and inference latency.",
        "tldr_zh": "该论文介绍了Egocentric World Model (EgoWM)，它将预训练的视频扩散模型转化为行动条件下的世界模型，用于可控的未来预测，并在结构一致性和推理延迟方面有所改进。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "StableWorld: Towards Stable and Consistent Long Interactive Video Generation",
        "summary": "In this paper, we explore the overlooked challenge of stability and temporal consistency in interactive video generation, which synthesizes dynamic and controllable video worlds through interactive behaviors such as camera movements and text prompts. Despite remarkable progress in world modeling, current methods still suffer from severe instability and temporal degradation, often leading to spatial drift and scene collapse during long-horizon interactions. To better understand this issue, we initially investigate the underlying causes of instability and identify that the major source of error accumulation originates from the same scene, where generated frames gradually deviate from the initial clean state and propagate errors to subsequent frames. Building upon this observation, we propose a simple yet effective method, \\textbf{StableWorld}, a Dynamic Frame Eviction Mechanism. By continuously filtering out degraded frames while retaining geometrically consistent ones, StableWorld effectively prevents cumulative drift at its source, leading to more stable and temporal consistency of interactive generation. Promising results on multiple interactive video models, \\eg, Matrix-Game, Open-Oasis, and Hunyuan-GameCraft, demonstrate that StableWorld is model-agnostic and can be applied to different interactive video generation frameworks to substantially improve stability, temporal consistency, and generalization across diverse interactive scenarios.",
        "url": "http://arxiv.org/abs/2601.15281v1",
        "published_date": "2026-01-21T18:59:02+00:00",
        "updated_date": "2026-01-21T18:59:02+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Ying Yang",
            "Zhengyao Lv",
            "Tianlin Pan",
            "Haofan Wang",
            "Binxin Yang",
            "Hubery Yin",
            "Chen Li",
            "Ziwei Liu",
            "Chenyang Si"
        ],
        "tldr": "The paper introduces StableWorld, a dynamic frame eviction mechanism, to improve stability and temporal consistency in long interactive video generation by preventing error accumulation from degraded frames.",
        "tldr_zh": "该论文介绍了StableWorld，一种动态帧剔除机制，通过防止降级帧的误差累积，从而提高长交互视频生成中的稳定性和时间一致性。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Uncertainty-guided Generation of Dark-field Radiographs",
        "summary": "X-ray dark-field radiography provides complementary diagnostic information to conventional attenuation imaging by visualizing microstructural tissue changes through small-angle scattering. However, the limited availability of such data poses challenges for developing robust deep learning models. In this work, we present the first framework for generating dark-field images directly from standard attenuation chest X-rays using an Uncertainty-Guided Progressive Generative Adversarial Network. The model incorporates both aleatoric and epistemic uncertainty to improve interpretability and reliability. Experiments demonstrate high structural fidelity of the generated images, with consistent improvement of quantitative metrics across stages. Furthermore, out-of-distribution evaluation confirms that the proposed model generalizes well. Our results indicate that uncertainty-guided generative modeling enables realistic dark-field image synthesis and provides a reliable foundation for future clinical applications.",
        "url": "http://arxiv.org/abs/2601.15859v1",
        "published_date": "2026-01-22T11:07:19+00:00",
        "updated_date": "2026-01-22T11:07:19+00:00",
        "categories": [
            "cs.LG",
            "cs.CV"
        ],
        "authors": [
            "Lina Felsner",
            "Henriette Bast",
            "Tina Dorosti",
            "Florian Schaff",
            "Franz Pfeiffer",
            "Daniela Pfeiffer",
            "Julia Schnabel"
        ],
        "tldr": "The paper introduces an uncertainty-guided progressive GAN for generating dark-field radiographs from standard X-rays, addressing the data scarcity issue and showing good generalization.",
        "tldr_zh": "该论文介绍了一种不确定性引导的渐进式GAN，用于从标准X射线生成暗场X射线照片，解决了数据稀缺问题并显示出良好的泛化能力。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Relative Classification Accuracy: A Calibrated Metric for Identity Consistency in Fine-Grained K-pop Face Generation",
        "summary": "Denoising Diffusion Probabilistic Models (DDPMs) have achieved remarkable success in high-fidelity image generation. However, evaluating their semantic controllability-specifically for fine-grained, single-domain tasks-remains challenging. Standard metrics like FID and Inception Score (IS) often fail to detect identity misalignment in such specialized contexts. In this work, we investigate Class-Conditional DDPMs for K-pop idol face generation (32x32), a domain characterized by high inter-class similarity. We propose a calibrated metric, Relative Classification Accuracy (RCA), which normalizes generative performance against an oracle classifier's baseline. Our evaluation reveals a critical trade-off: while the model achieves high visual quality (FID 8.93), it suffers from severe semantic mode collapse (RCA 0.27), particularly for visually ambiguous identities. We analyze these failure modes through confusion matrices and attribute them to resolution constraints and intra-gender ambiguity. Our framework provides a rigorous standard for verifying identity consistency in conditional generative models.",
        "url": "http://arxiv.org/abs/2601.15560v1",
        "published_date": "2026-01-22T00:58:59+00:00",
        "updated_date": "2026-01-22T00:58:59+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Sylvey Lin",
            "Eranki Vasistha"
        ],
        "tldr": "The paper introduces a new metric, Relative Classification Accuracy (RCA), to evaluate identity consistency in fine-grained K-pop idol face generation using conditional DDPMs, revealing a trade-off between visual quality and semantic accuracy.",
        "tldr_zh": "本文提出了一种新的指标，相对分类准确率 (RCA)，用于评估使用条件 DDPM 的细粒度 K-pop 偶像面部生成中的身份一致性，揭示了视觉质量和语义准确性之间的权衡。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Consistency-Regularized GAN for Few-Shot SAR Target Recognition",
        "summary": "Few-shot recognition in synthetic aperture radar (SAR) imagery remains a critical bottleneck for real-world applications due to extreme data scarcity. A promising strategy involves synthesizing a large dataset with a generative adversarial network (GAN), pre-training a model via self-supervised learning (SSL), and then fine-tuning on the few labeled samples. However, this approach faces a fundamental paradox: conventional GANs themselves require abundant data for stable training, contradicting the premise of few-shot learning. To resolve this, we propose the consistency-regularized generative adversarial network (Cr-GAN), a novel framework designed to synthesize diverse, high-fidelity samples even when trained under these severe data limitations. Cr-GAN introduces a dual-branch discriminator that decouples adversarial training from representation learning. This architecture enables a channel-wise feature interpolation strategy to create novel latent features, complemented by a dual-domain cycle consistency mechanism that ensures semantic integrity. Our Cr-GAN framework is adaptable to various GAN architectures, and its synthesized data effectively boosts multiple SSL algorithms. Extensive experiments on the MSTAR and SRSDD datasets validate our approach, with Cr-GAN achieving a highly competitive accuracy of 71.21% and 51.64%, respectively, in the 8-shot setting, significantly outperforming leading baselines, while requiring only ~5 of the parameters of state-of-the-art diffusion models. Code is available at: https://github.com/yikuizhai/Cr-GAN.",
        "url": "http://arxiv.org/abs/2601.15681v1",
        "published_date": "2026-01-22T06:02:39+00:00",
        "updated_date": "2026-01-22T06:02:39+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yikui Zhai",
            "Shikuang Liu",
            "Wenlve Zhou",
            "Hongsheng Zhang",
            "Zhiheng Zhou",
            "Xiaolin Tian",
            "C. L. Philip Chen"
        ],
        "tldr": "The paper introduces a consistency-regularized GAN (Cr-GAN) for few-shot SAR target recognition, addressing the data scarcity issue by synthesizing high-fidelity samples, which outperforms existing methods while using fewer parameters than diffusion models.",
        "tldr_zh": "该论文介绍了一种用于少样本 SAR 目标识别的一致性正则化 GAN (Cr-GAN)，通过合成高保真样本来解决数据稀缺问题，其性能优于现有方法，同时使用的参数比扩散模型更少。",
        "relevance_score": 4,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 6
    }
]